# Techniques d'anonymisation

* Utilisation de generalisation

In [5]:
import pandas as pd
df = pd.read_csv("data_patient_age.csv")
df

            patient  age reactif  resultat
0    Alain flouflou   25       A        79
1   Abdel flouclair   35       A        81
2  Annie clairclair   45       B        47

In [7]:
#Déclarer la regle de généralisation
'''
< 20
20-30
31-40
41-50
>50
'''
 
df["age_interval"] = df["age"].map(lambda x: "<20" if  x< 0 else "20-30" if x<30 else "31-40" if x < 40 
                             else "41-50" if x<50 else "> 50")

df

            patient  age reactif  resultat age_interval
0    Alain flouflou   25       A        79        20-30
1   Abdel flouclair   35       A        81        31-40
2  Annie clairclair   45       B        47        41-50

In [9]:
#anonymiser en effectuant un merge avec une suppression de la serie patient
res = df.drop('age', axis=1)
res

            patient reactif  resultat age_interval
0    Alain flouflou       A        79        20-30
1   Abdel flouclair       A        81        31-40
2  Annie clairclair       B        47        41-50

In [10]:
#renommer la serie age_interval vers age
res = res.rename(columns={'age_interval': 'age'})
res

            patient reactif  resultat    age
0    Alain flouflou       A        79  20-30
1   Abdel flouclair       A        81  31-40
2  Annie clairclair       B        47  41-50

In [11]:
# Réarranger les colonnes en mettant age en premier
res = res[['patient','age', 'reactif', 'resultat']]
res

            patient    age reactif  resultat
0    Alain flouflou  20-30       A        79
1   Abdel flouclair  31-40       A        81
2  Annie clairclair  41-50       B        47

In [29]:
#sauvegarder le data transformé
res.to_csv("data_patient_age_anonyme.csv", index=False)